example/example.org
#+TITLE: Phil McCracken
#+LANGUAGE: en
#+OPTIONS: toc:nil H:10 tex:t
#+STARTUP: odd hidestars indent showall
#+INCLUDE: personal_info.org
#+LaTeX_CLASS: article
#+LaTeX_HEADER: \usepackage{mycv}
#+LaTeX_HEADER: \hypersetup{hidelinks}
#+LaTeX_HEADER: \usepackage{enumitem}
#+LaTeX_HEADER: \setlist{nolistsep}
#+LaTeX_HEADER: \pagenumbering{gobble}
#+LaTeX_CLASS_OPTIONS: [letterpaper]

{{{SUBTITLEROWS}}}
{{{HEADER}}}

* Summary

Full-stack software engineer. Python/PHP backend processing, services and tool development. Linux and Windows standalone application development. Distributable compiled remote solutions with rigid RESTful or JSON API implementation. Experience with database modeling using both ORM or custom models. Responsive frontend HTML5 views and custom or framework-based JavaScript data-binding methodologies. AJAX and websocket experience. Integration of external SOAP and RESTful API data sources. Concurrent processing and message queues.

* Skills

- *Languages*: /Expert in/ Python, PHP, Javascript, Bash, SQL; /Proficient in/ Java, C/C++
- *Frameworks*: /Expert in/ CodeIgniter, Django, jQuery, WordPress, Bootstrap; /Proficient in/ Backbone.js, Joomla, Flask
- *Databases*: /Expert in/ MySQL, PostgreSQL; /Proficient in/ SQLite3, MongoDB
- *Web Servers*: /Expert in/ Apache; /Proficient in/ NginX
- *APIs*: Zendesk; Amazon Marketplace; Christie, GDC, Doremi, Sony and Dolby digital cinema servers
- *Markup*: /Expert in/ HTML5, CSS3, JSON, XML, Markdown, Handlebars; /Proficient in/ LaTeX, Emacs Org-mode
- *Platforms*: /Expert in/ Linux (Debian, EL and Arch); /Proficient in/ Windows (for Python), Vagrant, Docker
- *Tools*: /Expert in/ Emacs, Aptana (for PHP), Eclipse (for Java), Git, SSH, Python unittest, SNMP; /Proficient in/ Jenkins, Ansible, Puppet, ZeroMQ (for websocket), RabbitMQ, phpunit
- *Design Patterns*: /Expert in/ Object-Oriented, Model-View-Controller, Extract-Transform-Load, brokers, event-driven, concurrency, algorithms; /Proficient in/ microservices, publish/subscribe (MQ)
- *Methodologies*: Agile, Waterfall, Test Driven Development, Continuous Integration

* Experience

*** Lead Software Engineer at Really Cool Apps, LLC
***** Jun 2014 - Now
/example.com/ \hfill /Miami, Florida/\\
\vspace{0.1in}

Building solutions for digital cinema equipment monitoring, support center management, and introspection into client theater circuits in Latin and North America.\\
\vspace{0.1in}

- Promoted through the ranks from Junior Web Developer to Lead Software Engineer in a year and a half.
- Lead developer of the team creating remote, compiled agents (in Python) that concurrently broker remote digital cinema server APIs and POS systems, extract SNMP data from projectors and audio equipment, extract host profile data, and then transform and deliver JSON packets to the Cielo API for post-processing and ingestion. Agents run as autoupdating services. Developed installers for Linux or Windows.
- Backend developer creating RESTful API (in PHP) to provide remote configuration to, and receive and save data from remote monitoring agents. Additional post-processing conforms incoming data to database tables for frontend and business usage.
- Backend developer creating scheduled and event-driven services (in Bash, PHP and Python) like SMTP and SMS alert notification, Zendesk support ticket processing, remote agent and server KPIs, data post-processing, and CSV-to-XLSX report conversion.
- MVC developer creating admin utility (in PHP and jQuery) providing CRUD to Cielo operations and partners to manage theater and auditorium configuration, as well as comprehensive real-time monitoring to the Cielo support center and their partners.
- MVC developer creating Cielo web application (in PHP, jQuery and Backbone.js) to provide cinema owners, managers and techs with responsive, real-time, tiered monitoring of playback and equipment states, with configurable alerts and extensive reporting.
- Lead developer responsible for maintaining the Cielo code base, including build and release processes, developing tooling, all code reviews and pull requests for contracted and remote developers, and version and database migration control.

*** Freelance Web Developer at Super Cycling
***** Mar - May 2015
/example.com/ \hfill /Miami, Florida/\\
\vspace{0.1in}

Emergency migration of e-commerce Wordpress web site for this chain of bicycle shops.
\vspace{0.1in}

- Recreated Wordpress site on dedicated, client-owned hosts -- provided only with database dump and theme files from original developer's shared hosting site.
- Utilized string search and replace for host URLs and permalinks in unstructured data of SQL dump to re-establish internal links without manually recreating plugin states.

*** Freelance Web Designer/Developer at Computer Systems of Taos
***** Oct 2012 - Mar 2014
/Taos, New Mexico/\\
\vspace{0.1in}

Designed, developed and then maintained the Wordpress web site for this 15-year-old computer repair and retail business.
\vspace{0.1in}

- Implemented Wordpress with product CMS for simple updating of pages and posts, including product pages and categories.
- Re-designed the corporate identity -- including print promotional material (advertisements, business cards, fliers, etc.) -- to be consistent with the web site.
- Re-designed the logo and a created unique, regional user experience.

*** Shop Manager at Computer Systems of Taos
***** Jan 2013 - Mar 2014
/Taos, New Mexico/\\
\vspace{0.1in}

Following the deployment of their web site, I was hired to manage all day-to-day operations of this 15-year-old computer repair and retail business.

* Education

*** University of New Mexico, Main Campus - Albuquerque, NM
***** Sep 2010 - Dec 2013
/Bachelor of Science, Mathematics (Pure) and Computer Science/
