example/example.tex
% Created 2016-01-03 Sun 14:36
\documentclass[letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{mycv}
\hypersetup{hidelinks}
\usepackage{enumitem}
\setlist{nolistsep}
\pagenumbering{gobble}
\author{Joseph Edwards VIII}
\date{\today}
\title{Phil McCracken}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\subtitlerows{ Software Engineer }{ Full-Stack Web Development, Application, Architecture }
\resheader{ 575.555.1212 }{ example.com }{ 123 Main St. }{ devguy@example.com }{ github.com/example }{ Anywhere, NY 33156 }

\section{Summary}
\label{sec-1}

Full-stack software engineer. Python/PHP backend processing, services and tool development. Linux and Windows standalone application development. Distributable compiled remote solutions with rigid RESTful or JSON API implementation. Experience with database modeling using both ORM or custom models. Responsive frontend HTML5 views and custom or framework-based JavaScript data-binding methodologies. AJAX and websocket experience. Integration of external SOAP and RESTful API data sources. Concurrent processing and message queues.

\section{Skills}
\label{sec-2}

\begin{itemize}
\item \textbf{Languages}: \emph{Expert in} Python, PHP, Javascript, Bash, SQL; \emph{Proficient in} Java, C/C++
\item \textbf{Frameworks}: \emph{Expert in} CodeIgniter, Django, jQuery, WordPress, Bootstrap; \emph{Proficient in} Backbone.js, Joomla, Flask
\item \textbf{Databases}: \emph{Expert in} MySQL, PostgreSQL; \emph{Proficient in} SQLite3, MongoDB
\item \textbf{Web Servers}: \emph{Expert in} Apache; \emph{Proficient in} NginX
\item \textbf{APIs}: Zendesk; Amazon Marketplace; Christie, GDC, Doremi, Sony and Dolby digital cinema servers
\item \textbf{Markup}: \emph{Expert in} HTML5, CSS3, JSON, XML, Markdown, Handlebars; \emph{Proficient in} \LaTeX{}, Emacs Org-mode
\item \textbf{Platforms}: \emph{Expert in} Linux (Debian, EL and Arch); \emph{Proficient in} Windows (for Python), Vagrant, Docker
\item \textbf{Tools}: \emph{Expert in} Emacs, Aptana (for PHP), Eclipse (for Java), Git, SSH, Python unittest, SNMP; \emph{Proficient in} Jenkins, Ansible, Puppet, ZeroMQ (for websocket), RabbitMQ, phpunit
\item \textbf{Design Patterns}: \emph{Expert in} Object-Oriented, Model-View-Controller, Extract-Transform-Load, brokers, event-driven, concurrency, algorithms; \emph{Proficient in} microservices, publish/subscribe (MQ)
\item \textbf{Methodologies}: Agile, Waterfall, Test Driven Development, Continuous Integration
\end{itemize}

\section{Experience}
\label{sec-3}

\subsection{Lead Software Engineer at Really Cool Apps, LLC}
\label{sec-3-1}
\subsubsection{Jun 2014 - Now}
\label{sec-3-1-1}
\emph{example.com} \hfill \emph{Miami, Florida}\\
\vspace{0.1in}

Building solutions for digital cinema equipment monitoring, support center management, and introspection into client theater circuits in Latin and North America.\\
\vspace{0.1in}

\begin{itemize}
\item Promoted through the ranks from Junior Web Developer to Lead Software Engineer in a year and a half.
\item Lead developer of the team creating remote, compiled agents (in Python) that concurrently broker remote digital cinema server APIs and POS systems, extract SNMP data from projectors and audio equipment, extract host profile data, and then transform and deliver JSON packets to the Cielo API for post-processing and ingestion. Agents run as autoupdating services. Developed installers for Linux or Windows.
\item Backend developer creating RESTful API (in PHP) to provide remote configuration to, and receive and save data from remote monitoring agents. Additional post-processing conforms incoming data to database tables for frontend and business usage.
\item Backend developer creating scheduled and event-driven services (in Bash, PHP and Python) like SMTP and SMS alert notification, Zendesk support ticket processing, remote agent and server KPIs, data post-processing, and CSV-to-XLSX report conversion.
\item MVC developer creating admin utility (in PHP and jQuery) providing CRUD to Cielo operations and partners to manage theater and auditorium configuration, as well as comprehensive real-time monitoring to the Cielo support center and their partners.
\item MVC developer creating Cielo web application (in PHP, jQuery and Backbone.js) to provide cinema owners, managers and techs with responsive, real-time, tiered monitoring of playback and equipment states, with configurable alerts and extensive reporting.
\item Lead developer responsible for maintaining the Cielo code base, including build and release processes, developing tooling, all code reviews and pull requests for contracted and remote developers, and version and database migration control.
\end{itemize}

\subsection{Freelance Web Developer at Super Cycling}
\label{sec-3-2}
\subsubsection{Mar - May 2015}
\label{sec-3-2-1}
\emph{example.com} \hfill \emph{Miami, Florida}\\
\vspace{0.1in}

Emergency migration of e-commerce Wordpress web site for this chain of bicycle shops.
\vspace{0.1in}

\begin{itemize}
\item Recreated Wordpress site on dedicated, client-owned hosts -- provided only with database dump and theme files from original developer's shared hosting site.
\item Utilized string search and replace for host URLs and permalinks in unstructured data of SQL dump to re-establish internal links without manually recreating plugin states.
\end{itemize}

\subsection{Freelance Web Designer/Developer at Computer Systems of Taos}
\label{sec-3-3}
\subsubsection{Oct 2012 - Mar 2014}
\label{sec-3-3-1}
\emph{Taos, New Mexico}\\
\vspace{0.1in}

Designed, developed and then maintained the Wordpress web site for this 15-year-old computer repair and retail business.
\vspace{0.1in}

\begin{itemize}
\item Implemented Wordpress with product CMS for simple updating of pages and posts, including product pages and categories.
\item Re-designed the corporate identity -- including print promotional material (advertisements, business cards, fliers, etc.) -- to be consistent with the web site.
\item Re-designed the logo and a created unique, regional user experience.
\end{itemize}

\subsection{Shop Manager at Computer Systems of Taos}
\label{sec-3-4}
\subsubsection{Jan 2013 - Mar 2014}
\label{sec-3-4-1}
\emph{Taos, New Mexico}\\
\vspace{0.1in}

Following the deployment of their web site, I was hired to manage all day-to-day operations of this 15-year-old computer repair and retail business.

\section{Education}
\label{sec-4}

\subsection{University of New Mexico, Main Campus - Albuquerque, NM}
\label{sec-4-1}
\subsubsection{Sep 2010 - Dec 2013}
\label{sec-4-1-1}
\emph{Bachelor of Science, Mathematics (Pure) and Computer Science}
% Emacs 24.3.1 (Org mode 8.2.10)
\end{document}
